apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_pm.c
  flash_enable_time_us = VDD_SDIO_POWERUP_TO_FLASH_READ_US
                         + DEEP_SLEEP_WAKEUP_DELAY;

  /* When SPIRAM is disabled in menuconfig, the minimum sleep time of the
   * system needs to meet the sum below:
   * 1. Wait time for the flash power-on after waking up;
   * 2. The execution time of codes between RTC Timer get start time
   *    with hardware starts to switch state to sleep;
   * 3. The hardware state switching time of the rtc state machine during
   *    sleep and wake-up. This process requires 6 cycles to complete.
   *    The specific hardware state switching process and the cycles
   *    consumed are rtc_cpu_run_stall(1), cut_pll_rtl(2), cut_8m(1),
   *    min_protect(2);
   * 4. All the adjustment time which is
   *    s_config.sleep_time_adjustment below.
   */

  vddsdio_pd_sleep_duration = MAX(FLASH_PD_MIN_SLEEP_TIME_US,
      flash_enable_time_us + LIGHT_SLEEP_MIN_TIME_US +
      s_config.sleep_time_adjustment + esp32c3_rtc_time_slowclk_to_us(
        RTC_MODULE_SLEEP_PREPARE_CYCLES, s_config.rtc_clk_cal_period));

  if (s_config.sleep_duration > vddsdio_pd_sleep_duration)
    {
      pd_flags |= RTC_SLEEP_PD_VDDSDIO;
      if (s_config.sleep_time_overhead_out < flash_enable_time_us)
        {
          s_config.sleep_time_adjustment += flash_enable_time_us;
        }
    }
  else
    {
      if (s_config.sleep_time_overhead_out > flash_enable_time_us)
        {
          s_config.sleep_time_adjustment -= flash_enable_time_us;
        }
    }

  esp32c3_periph_inform_out_sleep_overhead(
    s_config.sleep_time_adjustment - sleep_time_overhead_in);

  esp32c3_get_vddsdio_config(&vddsdio_config);

  /* Enter sleep, then wait for flash to be ready on wakeup */

  ret = esp32c3_light_sleep_inner(pd_flags, flash_enable_time_us,
                                               vddsdio_config);

  if (sleep_time != NULL)
    {
      *sleep_time = esp32c3_rtc_time_slowclk_to_us(esp32c3_rtc_time_get() -
          s_config.rtc_ticks_at_sleep_start, s_config.rtc_clk_cal_period);
    }

  s_config.sleep_time_overhead_out = (esp32c3_cpu_cycle_count() -
       s_config.ccount_ticks_record) / (esp32c3_clk_cpu_freq() / 1000000ULL);

  leave_critical_section(flags);

  return ret;
}

/****************************************************************************
 * Name: esp32c3_pmstandby
 *
 * Description:
 *   Enter force sleep.
 *
 * Input Parameters:
 *   time_in_us - force sleep time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32c3_pmstandby(uint64_t time_in_us)
{
  uint64_t rtc_diff_us;
#ifdef CONFIG_ESP32C3_RT_TIMER
  uint64_t hw_start_us;
  uint64_t hw_end_us;
  uint64_t hw_diff_us;
#endif

  /* don't power down XTAL - powering it up takes different time on. */

  esp32c3_sleep_enable_rtc_timer_wakeup(time_in_us);
#ifdef CONFIG_ESP32C3_RT_TIMER
  /* Get rt-timer timestamp before entering sleep */

  hw_start_us = rt_timer_time_us();
#endif

  esp32c3_light_sleep_start(&rtc_diff_us);

#ifdef CONFIG_ESP32C3_RT_TIMER
  /* Get rt-timer timestamp after waking up from sleep */

  hw_end_us = rt_timer_time_us();
  hw_diff_us = hw_end_us - hw_start_us;
  DEBUGASSERT(rtc_diff_us > hw_diff_us);

  rt_timer_calibration(rtc_diff_us - hw_diff_us);
#endif

#ifdef CONFIG_SCHED_TICKLESS
  up_step_idletime((uint32_t)time_in_us);
#endif

  pwrinfo("Returned from auto-sleep, slept for %" PRIu32 " ms\n",
            (uint32_t)(rtc_diff_us) / 1000);
}

/****************************************************************************
 * Name:  esp32c3_deep_sleep_start
 *
 * Description:
 *   Enter deep sleep mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32c3_deep_sleep_start(void)
{
  uint32_t pd_flags;

  /* record current RTC time */

  s_config.rtc_ticks_at_sleep_start = esp32c3_rtc_time_get();

  /* Decide which power domains can be powered down */

  pd_flags = esp32c3_get_power_down_flags();
  s_config.rtc_clk_cal_period = getreg32(RTC_SLOW_CLK_CAL_REG);

  /* Correct the sleep time */

  s_config.sleep_time_adjustment = DEEP_SLEEP_TIME_OVERHEAD_US;

  /* Enter deep sleep */

  esp32c3_sleep_start(RTC_SLEEP_PD_DIG | RTC_SLEEP_PD_VDDSDIO | pd_flags);

  /* Because RTC is in a slower clock domain than the CPU, it
   * can take several CPU cycles for the sleep mode to start.
   */

  while (1);
}

/****************************************************************************
 * Name: esp32c3_pmsleep
 *
 * Description:
 *   Enter deep sleep.
 *
 * Input Parameters:
 *   time_in_us - deep sleep time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32c3_pmsleep(uint64_t time_in_us)
{
  esp32c3_sleep_enable_rtc_timer_wakeup(time_in_us);
  esp32c3_deep_sleep_start();
}

/****************************************************************************
 * Name: esp32c3_pm_lockacquire
 *
 * Description:
 *   Take a power management lock
 *
 ****************************************************************************/

void IRAM_ATTR esp32c3_pm_lockacquire(void)
{
  ++pm_wakelock;
}

/****************************************************************************
 * Name: esp32c3_pm_lockrelease
 *
 * Description:
 *   Release the lock taken using esp32c3_pm_lockacquire.
 *
 ****************************************************************************/

void IRAM_ATTR esp32c3_pm_lockrelease(void)
{
  --pm_wakelock;
}

/****************************************************************************
 * Name: esp32c3_pm_lockstatus
 *
 * Description:
 *   Return power management lock status.
 *
 ****************************************************************************/

uint32_t IRAM_ATTR esp32c3_pm_lockstatus(void)
{
  return pm_wakelock;
}

#endif /* CONFIG_PM */
